// 그냥 일반 클래스 하나 생성할 때 public class 클래스이름 { }

// ★★★★★ Step 1 ★★★★★
// String =====> 문자열
// 필드 = 변수, 변수표기
// phoneNum같이 단어를 합쳐 만든 변수는 두번째단어 첫번째글자에 대문자를 사용해서 낙타 등 같다. 그래서 camel 표기법이라고 한다.
// printMember(name, age, phoneNum); <===== 이러한 형태를 메서드의 매개변수로 값을 전달한다고 한다.
// 매개변수 = 파라미터
// 자바를 쓰는 모든 프로그램에서 대괄호 []가 들어있으면 무조건 배열형
// 같은 이름의 매서드인데 파라미터(매개변수)를 다르게 만든 매서드를 오버로딩이라고 함. 이름은같아도, 로딩하는게 다름.
// 간단하게 오버로드란, 같은 이름인데 매개변수가 다른 것.
// 배열은 값을 참조할 때 주소(index)를 사용하는데, 그게 0번 주소부터 시작한다. 그래서 cnt=0부터 시작하는거임


// ★★★★★ Step 2 ★★★★★
// ValueObject 클래스형 자료형
// get set 메서드를 한번에 만드는 방법: 마우스오른쪽클릭-->Source--->Grenerate getters and setters
// public void에서 void(0)는 실행 메서드이긴한데, 돌려받는값이 없음.반환값이 없음 void = return false


// ★★★★★ Step 3 ★★★★★
// 열거형클래스-enum클래스
// 












